       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLJCB06.
	   AUTHOR. JEFF BIRKNER.
	   DATE-WRITTEN. 10/31/23.
       DATE-COMPILED. 10/31/23.

       ENVIRONMENT DIVISION.
		   SELECT SALESFILE
			   ASSIGN TO 'C:\COBOLFA23\CBLJCB06\FURN.DAT'
				   ORGANIZATION IS LINE SEQUENTIAL.

		   SELECT SUMMARYFILE
			   ASSIGN TO 'C:\COBOLFA23\CBLJCB06\CBLSMRY.PRT'
				   ORGANIZATION IS RECORD SEQUENTIAL.
           


	   FILE SECTION.
	   FD SALESFILE
	   LABEL RECORD IS STANDARD
	   DATA RECORD IS ST-REC
	   RECORD CONTAINS 42 CHARACTERS.

	   01	ST-REC.
	      05	ST-SLM-NUM		PIC 99.
	      05	ST-DAY			PIC 9.
	      05	ST-AMOUNT		PIC S9(5)V99.
	      05	ST-FUR-CODE		PIC 9.
	      05	ST-SALES-DATE	PIC 9(6).
	      05	ST-SLM-NAME		PIC X(25).


	   
	   FD SUMMARYFILE
	   LABEL RECORD IS OMITTED
	   DATA RECORD IS SUMMARY-REC
	   RECORD CONTAINS 132 CHARACTERS
	   LINAGE IS 60 WITH FOOTING AT 56.

	   01 SUMMARY-REC               PIC X(132).

       WORKING-STORAGE SECTION.
       01 SALESTABLE.
           05 SALESPERSON  OCCURS 15 TIMES.
               10 WEEKLYTOTAL       PIC S9(9)V99   VALUE 0.
               10 DAILYTOTAL   OCCURS 7 TIMES.
                   15 DAYTOTAL      PIC S9(9)V99   VALUE 0.


       01 MORE-RECS                PIC X.
       01 WS-AMOUNT                PIC S9(9)V99    VALUE 0.

       01 DETAIL-LINE.
           05 O-SALESPERSON        PIC X(25).
           05 O-DAILY-AMT          PIC S9(5)V99.         

       PROCEDURE DIVISION.
       0000-MAIN.
           PERFORM 1000-INIT.
           PERFORM 2000-MAINLINE
               UNTIL MORE-RECS = 'N'.
           PERFORM 3000-CLOSING.
           STOP RUN.

       1000-INIT.
           OPEN INPUT SALESFILE.
           OPEN OUTPUT SUMMARYFILE.
           INITIALIZE SALESTABLE.
           PERFORM 9000-READ.

       2000-MAINLINE.
           PERFORM 2200-CALC.
           PERFORM 2100-OUTPUT.
           PERFORM 9000-READ.

       2100-OUTPUT.
           PERFORM VARYING ST-SLM-NUM FROM 1 BY 1
               UNTIL ST-SLM-NUM > 15
               PERFORM VARYING ST-DAY FROM 1 BY 1
                   UNTIL ST-DAY > 7
                   MOVE SALESPERSON(ST-SLM-NUM) TO O-SALESPERSON
                   MOVE DAYTOTAL(ST-SLM-NUM, ST-DAY) TO O-DAILY-AMT
                       WRITE SUMMARY-REC FROM DETAIL-LINE
                           AFTER ADVANCING 1 LINE.


       

       2200-CALC.
           ADD ST-AMOUNT TO DAYTOTAL(ST-SLM-NUM,ST-DAY).


       3000-CLOSING.
           CLOSE SALESFILE.
           CLOSE SUMMARYFILE.


       9000-READ.
           READ SALESFILE
               AT END MOVE 'N' TO MORE-RECS.