       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLJCB06.
	   AUTHOR. JEFF BIRKNER.
	   DATE-WRITTEN. 10/31/23.
       DATE-COMPILED. 10/31/23.

       ENVIRONMENT DIVISION.
		   SELECT SALESFILE
			   ASSIGN TO 'C:\COBOLFA23\CBLJCB06\FURN.DAT'
				   ORGANIZATION IS LINE SEQUENTIAL.

		   SELECT SUMMARYFILE
			   ASSIGN TO 'C:\COBOLFA23\CBLJCB06\CBLSMRY.PRT'
				   ORGANIZATION IS RECORD SEQUENTIAL.
           


	   FILE SECTION.
	   FD SALESFILE
	   LABEL RECORD IS STANDARD
	   DATA RECORD IS ST-REC
	   RECORD CONTAINS 42 CHARACTERS.

	   01	ST-REC.
	      05	ST-SLM-NUM		PIC 99.
	      05	ST-DAY			PIC 9.
	      05	ST-AMOUNT		PIC S9(5)V99.
	      05	ST-FUR-CODE		PIC 9.
	      05	ST-SALES-DATE	PIC 9(6).
	      05	ST-SLM-NAME		PIC X(25).


	   
	   FD SUMMARYFILE
	   LABEL RECORD IS OMITTED
	   DATA RECORD IS SUMMARY-REC
	   RECORD CONTAINS 132 CHARACTERS
	   LINAGE IS 60 WITH FOOTING AT 56.

	   01 SUMMARY-REC               PIC X(132).

       WORKING-STORAGE SECTION.
       01 SALESTABLE.
           05 SALESPERSON      OCCURS 16 TIMES.
               10 DAILYTOTAL       PIC S9(9)V99 OCCURS 8 TIMES.

       01 FURN-CATEGORIES.
           05 CATEGORY OCCURS 9 TIMES.
               10 FILLER       PIC X(22) VALUE 'SOFAS/LOVESEATS'.
               10 FILLER       PIC X(22) VALUE 'CHAIRS'.
               10 FILLER       PIC X(22) VALUE 'COFFEE/END TABLES'.
               10 FILLER       PIC X(22) VALUE 'DINING ROOM TABLES'.
               10 FILLER       PIC X(22) VALUE 'DINING ROOM CHAIRS'.
               10 FILLER       PIC X(22) VALUE 'HUTCHES/CURIO CABINETS'.
               10 FILLER       PIC X(22) VALUE 'LAMPS'.
               10 FILLER       PIC X(22) VALUE 'MATTRESS/BOX SPRINGS'.
               10 FILLER       PIC X(22) VALUE 'BEDROOM FURNITURE'.

       01 FURN-CAT-TABLE REDEFINES FURN-CATEGORIES.
           05 FURN-CAT-INFO OCCURS 9 TIMES.
               10 FURN-CAT-DESC PIC X(22).

    


       01 MORE-RECS                PIC X. 
       01 I-VAR                    PIC X.
       
       01 WEEKLY-HEADING1.
           05 FILLER               PIC X(32)   VALUE 'SALESPERSON'.
           05 FILLER               PIC X(13)   VALUE 'SUNDAY'.
           05 FILLER               PIC X(12)   VALUE 'MONDAY'.
           05 FILLER               PIC X(11)   VALUE 'TUESDAY'.
           05 FILLER               PIC X(14)   VALUE 'WEDNESDAY'.
           05 FILLER               PIC X(15)   VALUE 'THURSDAY'.
           05 FILLER               PIC X(11)   VALUE 'FRIDAY'.
           05 FILLER               PIC X(18)   VALUE 'SATURDAY'.
           05 FILLER               PIC X(6)    VALUE 'WEEKLY'.

       01 WEEKLY-HEADING2.
           05 FILLER               PIC XXX     VALUE SPACES.
           05 FILLER               PIC X(4)    VALUE 'NAME'.

       01 WEEKLY-HEADING3.
           05 DASHES               PIC X(132)  VALUE SPACES.

       01 DETAIL-LINE.
           
           05 O-SALESPERSON        PIC X(25).
           05 FILLER               PIC XXX     VALUE SPACES.
           05 O-DAILY-AMT          PIC $$$,$$$.99    OCCURS 8 TIMES.
           05 FILLER               PIC XXX     VALUE SPACES.

       PROCEDURE DIVISION.
       0000-MAIN.
           PERFORM 1000-INIT.
           PERFORM 2000-MAINLINE
               UNTIL MORE-RECS = 'N'.
           PERFORM 3000-CLOSING.
           STOP RUN.

       1000-INIT.
           OPEN INPUT SALESFILE.
           OPEN OUTPUT SUMMARYFILE.
           INITIALIZE SALESTABLE.
           PERFORM 1100-WEEKLY-HEADING.
           PERFORM 9000-READ.

       1100-WEEKLY-HEADING.
           WRITE SUMMARY-REC FROM WEEKLY-HEADING1
               AFTER ADVANCING 2 LINES.
           WRITE SUMMARY-REC FROM WEEKLY-HEADING2
               AFTER ADVANCING 1 LINE.
           MOVE ALL '-' TO DASHES.
           WRITE SUMMARY-REC FROM WEEKLY-HEADING3
               AFTER ADVANCING 1 LINE.

       2000-MAINLINE.
           PERFORM 2200-CALC.
           PERFORM 9000-READ
           IF MORE-RECS = 'N'
               PERFORM 2100-OUTPUT
                   VARYING ST-SLM-NUM FROM 1 BY 1
                       UNTIL ST-SLM-NUM > 15.


       2100-OUTPUT.
           PERFORM 2110-OUTPUT
               VARYING ST-DAY FROM 1 BY 1
                   UNTIL ST-DAY > 7.
           MOVE ST-SLM-NAME TO O-SALESPERSON.
           WRITE SUMMARY-REC FROM DETAIL-LINE
               AFTER ADVANCING 1 LINE.
       

       2110-OUTPUT.
      *    MOVE ST-SLM-NAME TO O-SALESPERSON.
           MOVE DAILYTOTAL(ST-SLM-NUM, ST-DAY) TO O-DAILY-AMT(ST-DAY).



       

       2200-CALC.
           ADD ST-AMOUNT TO DAILYTOTAL(ST-SLM-NUM,ST-DAY).
      *    DISPLAY "DAY TOTAL " ST-SLM-NAME ":" ST-DAY ": "
      *    DAILYTOTAL(ST-SLM-NUM,ST-DAY).
      *    ACCEPT I-VAR.
           ADD ST-AMOUNT TO DAILYTOTAL(ST-SLM-NUM,8).
           ADD ST-AMOUNT TO DAILYTOTAL(16,ST-DAY).
           ADD ST-AMOUNT TO DAILYTOTAL(16,8).


       3000-CLOSING.
           CLOSE SALESFILE.
           CLOSE SUMMARYFILE.


       9000-READ.
           READ SALESFILE
               AT END MOVE 'N' TO MORE-RECS.